let firstCounter = prompt(
  "Введіть показник лічильника на кінець минулого місяця"
);
let lastCounter = prompt("Введіть поточний показник лічильника ");

let resultCounter = lastCounter - firstCounter; //розрахунок кількості спожитих квт електроенергії

let forPay = resultCounter * 2.64; //розрахунок вартості спожитої електроенергії
alert("Спожито: " + resultCounter + "квт"); //вивід на екран повідомлення про кількість спожитої електроенергії
alert("До сплати: " + forPay + "грн"); //вивід на екран повідомлення про вартість спожитої електроенергії
